Revit 2024 API
BuiltInFailures.KeyBasedTreeEntryFailures.DuplicateEntry Property
 Duplicate code '[Code]', description: '[Description]'
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DuplicateEntry { get; }
Visual Basic
Public Shared ReadOnly Property DuplicateEntry As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DuplicateEntry {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.KeyBasedTreeEntryFailures Class
Autodesk.Revit.DB Namespace